{
    "categories": {
        "0": "social network",
        "1": "email"
    },
    "description": "Google People API is the replacement for the deprecated Google Contacts API. This plugin allows you to read an authenticated user's list of contacts, including their Names, Emails, and Phone Numbers. \n\nUnlike other plugins, this requests the max pageSize of 1,000 contacts so you can sync your whole contact list in one go.",
    "image": "//meta-l.cdn.bubble.io/f1689790951629x342057161509362200/Screenshot%202023-07-19%20at%2011.21.42%20AM%20%281%29.png",
    "license": "open_source",
    "link": "https://developers.google.com/people",
    "name": "Google People (Contacts)",
    "plugin_instructions": "This plugin provides three API calls you can use with Bubble's [url=https://manual.bubble.io/core-resources/data/data-sources#get-data-from-an-external-api]Get data from an external API[/url] feature:\n\n1. List Connections - this returns a list of the user's saved Google contacts and their associated info. Maximum records returned: 1000.\n\n2. List Other Contacts - this returns a list of contacts that are not saved, but have been communicated with via Gmail. This API call can return many thousands of records, but paging must be implemented in your workflow to handle this. If there are multiple pages, a [b]nextPageToken[/b] parameter will be returned in the response. You need to capture that value and then send it in the [b]pageToken[/b] parameter in a new API call to request the next page. If there is no nextPageToken in the response, then there are no more pages. Without paging, only the first 1000 records will be returned.\n\n3. User Profile - this returns information from the user's own profile. This is useful with Bubble's [url=https://manual.bubble.io/core-resources/actions/account#signup-login-with-a-social-network]Signup/login with a social network[/url] workflow action. \n\nTo use this plugin, you'll need to get a Google Account, create a project for your client, and save your OAuth 2.0 Client ID and Client Secret.\n\nNote: to use this API in a live app in production, you'll need to request approval from Google to use the required scopes."
}